"""
10. Дані про температуру повітря за декаду листопада зберігаються в масиві.
Визначити, скільки разів температура опускалася нижче -10 градусів.

Олійник Богдан Сергійович 122\Д
"""

import numpy as np
import random as rd
a = [rd.randint(-11,7) for i in range(10)]
b = np.array(a)                                   #Створюємо масив 
print('Погода у листопаді з 1 по 10 число: ')
print(b)
j = 0
for i in b:                                       # Проходим по елементах масиву
    if i <- 10:                                   # Перевіряємо умову 
        j += 1
print(f'Погода нижче (-10) градусів: {k} раз')
