"""
12. Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки раз температура була вище середньої за цю декаду.

Олійник Богдан Сергійович 122/Д
"""

import numpy as np
import random as rd
a = [rd.randint(-6,5) for i in range(10)]
b = np.array(a)                             #Створюємо масив 
print('Температура з 1 по 10 грудня:')
print(b)
k = 0
for i in a:                                 #Проходим по елементах масиву 
    if i > b.mean():                        #Перевіряємо умову 
        k += 1                              
print(f'Темература була вищою за середню: {k} раз')
