"""
18. Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.

Олійник Богдан Сергійович 122\Д
"""
import numpy as np
a = []
for i in range(1,11): 
    k = int(input(f'Елемент {i} = '))
    a.append(k)
b = np.array(a)
k = 0
c = []
for g in b:                              #Проходимо по елементах 
    if g < 0:
      c.append(g)                       #Додаємо елементи що проходять умову до списка 
      k += 1
if k == 0:
    print(f'Елементів що задовільняють умову немає')
    exit(0)
j = np.array(c)
print(f'Елементи меньше нуля: {j} ')
print(f'Добуток: {j.prod()} ')
