"""
22. Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.
Заповнення масиву здійснити випадковими числами від 5 до 500.

Олійник Богдан Сергійович 122\Д
"""
import numpy as np
import random as rd
a = np.array([rd.randint(5,500) for i in range(10)])
b = []
k = 0
print(a)
for g in a:                                         #Проходимо по елементах 
    if g % 3 == 0 and g % 9 == 0 :
     b.append(g)                                    #Додаємо елементи що проходять умову для списка 
     k += 1
if k == 0:
      print('Елементів кратних 3-ьом і 9-ьом не виявлено')
      exit(0)
j= np.array(b)
print(f'Елементи кратні 3-ьом і 9-ьом:{j}')
print(f'Добуток:{j.prod()}')
