"""
23. Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 150 до 300.\

Олійник Богдан Сергійович 122\Д
"""
import numpy as np
import random
c = []
a = [random.randint(150,300) for i in range(20)]
b = np.array(a)
print(b)
k = 0
for i in b:                                      #Проходимо по елементах 
    if i < b.mean():
        c.append(i)                              #Додаємо до списку                                
        k += 1
if k == 0:
    print('Елементів що задовільняють умову не знайдено')
j = np.array(c)
print(f'Елементи що задовільняють умову:{j}')
print(f'Сума:{j.sum()} ')
