"""
25. Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 10 до
100.

Олійник Богдан Сергійович 122\Д
"""
import numpy as np
import random as rd
a = np.array([rd.randint(10,100) for i in range(10)])
b = []
k = 0
print(a)
for g in a:                                         #Проходимо по елементах 
    if g % 5 == 0:
     b.append(g)                                    #Додаємо до списку  
     k += 1
if k ==  0:
      print('Елементів кратних 5-ти немає')
      exit(0)
j = np.array(b)
print(f'Елементи кратні 5-ти: {j} ')
print(f'Добуток:{j.prod()}')
