"""
6. Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість
від’ємних елементів масиву.
О
лійник Богдан Сергійович 122/Д
"""

import numpy as np
import random as rd
a = [random.rd(-10,10) for i in range(8)]
b = np.array(a)                                   #Створюємо масив
print(a)
j = 0                                             
for i in a:                                     #Проходимо по елементах масиву
    if i < 0:                                   #Перевіряємо умову
        j += 1
print(f'Від ємних чисел: {j}')
