"""
7. Створіть масив А [1..12] за допомогою генератора випадкових чисел з
елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
масиву числом 0.

Олійник Богдан Сергійович 122\Д
"""


import numpy as np
import random as rd 
a = np.array([rd.randint(-20,11) for j in range(12)])       #Створюємо масив
print(a)
b = a
for i in range(len(b)):                                     #Проходим по елементах масиву
    if b[i] < 0:                                            #Перевіряємо
        a[i] = 0
print(b)
