"""
9. З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.

Олійник Богдан Сергійович 122\Д
"""
import numpy as np
temp = [ ]
a = 0
t = int(input('Темп ='))
t += 1
while a < 13:
    t -= 1
    temp.append(t)                         #Довання змін теператури
    a += 1
b = np.array(temp)                         
print(f'Зміна t з 8 до 20 години:\n{b}')
for i in range(len(b)):
    if b[i] < 0 :
     print(f' температура (-) о {8 + i} годині')
     break
else:
     print('Температура була (+)')
